html/how-to-define-software-stability.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何定义软件稳定</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">如何定义软件稳定</h1>
<p>
@2012-8-30 redis作者在自己的 <a href="http://antirez.com/post/redis-26-sentinel-update.html">博客</a> 中提到了如何定义软件到达了production-ready状态
</p>

<blockquote>
<p>
There are probably much more software engineering books than there should be ;) So despite of the general title of this section my goal here is to state what stable means for me and for the Redis project. After all there are a number of possible metrics, but mine is very simple and in the latest three years worked very reliably.
</p>

<p>
A Redis branch without active development (major changes to the source code that are not just additions without impacts to what we already have) is stable when the number of critical bugs discovered in the latest 8 weeks is near to zero.
</p>

<p>
In this context a critical bug is a bug that corrupts data, that crashes the server, that creates an inconsistency between master and slave, and that, at the same time, is not triggered by a crazy edge-case, so edge that it is unlikely to run into it involuntarily.
</p>
</blockquote>

<p>
在作者看来，一个稳定的版本意味着：
</p>
<ul class="org-ul">
<li>不会有影响到现有功能的修改
</li>
<li>在过去8周内没有严重的bug（比如宕机或者是数据损坏等），但是不考虑一些非常极端的case
</li>
</ul>
</div>
</body>
</html>
